# HasNoValueFilterRule Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
HasNoValueFilterRule Properties
HasNoValueFilterRule Class See Also
---
The HasNoValueFilterRule type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from FilterRule.) |
| Parameter | The parameter which will be evaluated to pass this rule.  (Inherited from ParameterValuePresenceRule.) |

# See Also
HasNoValueFilterRule Class
Autodesk.Revit.DB Namespace